
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>切片 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="ham.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="intro.html">
            
                <a href="intro.html">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="performance.html">
            
                <a href="performance.html">
            
                    
                    性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="term.html">
            
                <a href="term.html">
            
                    
                    术语
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="cap.html">
            
                <a href="cap.html">
            
                    
                    CAP 定理权衡
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="graph.html">
            
                <a href="graph.html">
            
                    
                    图的结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="conflict.html">
            
                <a href="conflict.html">
            
                    
                    冲突解决(核心)
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="ham.html">
            
                <a href="ham.html">
            
                    
                    假设失忆症机器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="sharding.html">
            
                <a href="sharding.html">
            
                    
                    切片
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >切片</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5206;&#x7247;">&#x5206;&#x7247;</h1>
<p>GUN &#x901A;&#x5E38;&#x8BA4;&#x4E3A;&#x5206;&#x7247;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x5E93;&#x5373;&#x670D;&#x52A1;">&#x6570;&#x636E;&#x5E93;&#x5373;&#x670D;&#x52A1;</h3>
<p>&#x6BD4;&#x5982;Compose&#xFF0C;Heroku&#x7684;Postgres&#xFF0C;Dropbox Datastore&#xFF0C;Firebase&#xFF0C;Parse&#x7B49;&#x3002;</p>
<h3 id="&#x5728;&#x4E91;&#x4E2D;&#x90E8;&#x7F72;&#x6570;&#x636E;&#x5E93;">&#x5728;&#x4E91;&#x4E2D;&#x90E8;&#x7F72;&#x6570;&#x636E;&#x5E93;</h3>
<p>&#x8FD9;&#x662F;&#x60A8;&#x5728;AWS EC2&#xFF0C;Google Cloud Engine&#xFF0C;Microsoft Azure&#xFF0C;Digital Ocean&#x7B49;&#x4E0A;&#x542F;&#x7528;&#x4E00;&#x4E2A;&#x6846;&#x5E76;&#x5B89;&#x88C5;&#x548C;&#x7EF4;&#x62A4;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x4F8B;&#x5982;MySQL&#xFF0C;MongoDB&#xFF0C;RethinkDB&#x7B49;&#xFF09;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<h3 id="&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7269;&#x7406;&#x673A;&#x5668;&#x4E0A;">&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7269;&#x7406;&#x673A;&#x5668;&#x4E0A;</h3>
<p>&#x867D;&#x7136;&#x4E0E;&#xFF08;2&#xFF09;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x60A8;&#x6700;&#x7EC8;&#x62E5;&#x6709;&#x90E8;&#x7F72;&#x7684;&#x786C;&#x4EF6; - &#x5728;&#x8D44;&#x6E90;&#x4E0D;&#x8DB3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x7269;&#x7406;&#x6DFB;&#x52A0;&#x786C;&#x76D8;&#x9A71;&#x52A8;&#x5668;&#x3002;</p>
<h2 id="&#x4F18;&#x70B9;">&#x4F18;&#x70B9;</h2>
<p>(1) &#x7684;&#x4F18;&#x70B9;&#x662F;&#xFF08;2) &#x548C;(3) &#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x5E76;&#x4E14;&#x56F0;&#x96BE;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;DevOps&#x548C;SysAdmins&#x662F;&#x5173;&#x952E;&#x89D2;&#x8272;&#x7684;&#x539F;&#x56E0;&#x3002;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x60A8;&#x7684;&#x8FD9;&#x4E9B;&#x89D2;&#x8272;&#x5916;&#x5305;&#x7ED9;&#x60A8;&#xFF0C;&#x800C;&#x5F53;&#x60A8;&#x8D85;&#x8D8A;&#x514D;&#x8D39;&#x589E;&#x503C;&#x7EA7;&#xFF0C;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x8F83;&#x6162;&#x4EE5;&#x53CA;&#x4E0D;&#x62E5;&#x6709;&#x60A8;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x89D2;&#x8272;&#x901A;&#x5E38;&#x4F1A;&#x975E;&#x5E38;&#x6602;&#x8D35;&#x3002;</p>
<p>(3) &#x7684;&#x4F18;&#x70B9;&#x662F;&#x60A8;&#x62E5;&#x6709;&#x60A8;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5B89;&#x5168;&#x6216;&#x76D1;&#x7BA1;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x662F;&#x5FC5;&#x9700;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B83;&#x906D;&#x53D7;&#x4E86;&#x4E25;&#x91CD;&#x7684;&#x75DB;&#x82E6;&#xFF0C;&#x524D;&#x671F;&#x6210;&#x672C;&#x548C;&#x4EBA;&#x5DE5;&#x5E72;&#x9884;&#x4EE5;&#x53CA;&#x8DE8;&#x5B66;&#x79D1;&#x7684;&#x5E7F;&#x6CDB;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x90E8;&#x7F72;&#x5230;&#x4E91;&#x8BA1;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x73AF;&#x8282;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x4ED8;&#x8D39;&#x5C06;&#x5916;&#x90E8;&#x5DE5;&#x4F5C;&#x5916;&#x5305;&#x51FA;&#x53BB;&#xFF0C;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x914D;&#x7F6E;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x865A;&#x62DF;&#x673A;&#x3002;&#x91CD;&#x8981;&#x7684;&#x533A;&#x522B;&#x662F;&#x4E8B;&#x7269;&#x662F;&#x865A;&#x62DF;&#x5316;&#x7684;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x8BA1;&#x7B97;&#x8FD8;&#x662F;&#x5B58;&#x50A8; - &#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x5DF2;&#x7ECF;&#x4E3A;&#x60A8;&#x62BD;&#x53D6;&#x4E86;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x7684;&#x7F29;&#x653E;&#x6BD4;&#x4F8B;&#x3002;</p>
<h2 id="&#x89C2;&#x5BDF;">&#x89C2;&#x5BDF;</h2>
<p>&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#xFF0C;&#x5145;&#x5F53;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x78C1;&#x76D8;&#x4E0A;&#x6570;&#x636E;&#x7684;&#x4EA4;&#x6613;&#x8005;&#x3002;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x8005;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x865A;&#x62DF;&#x5316;&#x5C42;&#x3002;&#x8FD9;&#x6837;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x3002;&#x4F46;&#x662F;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x5DF2;&#x7ECF;&#x5BF9;&#x865A;&#x62DF;&#x5316;&#x5B58;&#x50A8;&#x8FDB;&#x884C;&#x4E86;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x6BD4;&#x5982;S3&#x6216;&#x8005;GCS&#x6216;&#x8005;Azure Storage&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x201C;&#x65E0;&#x9650;&#x201D;&#x7684;&#x786C;&#x76D8;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5206;&#x914D;&#x78C1;&#x76D8;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x5B83;&#x4EEC;&#x662F; - &#x5E76;&#x4E14;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF0C;&#x4F46;&#x5176;&#x5927;&#x5C0F;&#x7684;&#x9650;&#x5236;&#x53D7;&#x5230;&#x5E95;&#x5C42;&#x865A;&#x62DF;&#x5316;&#x7684;&#x4EFB;&#x610F;&#x9650;&#x5236;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4EFB;&#x610F;&#x7EA6;&#x675F;&#x662F;&#x6570;&#x636E;&#x5E93;&#x548C;&#x4E91;&#x8BD5;&#x56FE;&#x53BB;&#x9664;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x7531;&#x4E8E;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x666E;&#x904D;&#x7684;&#x671F;&#x671B;&#xFF0C;&#x4E8B;&#x60C5;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E0D;&#x65AD;&#x8BC9;&#x8BF8;&#x6709;&#x9650;&#x7684;&#x9A71;&#x52A8;&#x5668;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x3002;&#x4F60;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x8FDD;&#x7EA6;&#x95EE;&#x9898;&#xFF1F;&#x901A;&#x8FC7;&#x5C06;&#x6570;&#x636E;&#x5206;&#x5757;&#x6210;&#x5FAE;&#x5C0F;&#x7684;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x5E76;&#x590D;&#x5236;&#x5230;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x7684;&#x4E13;&#x7528;&#x4E8E;&#x7279;&#x5B9A;&#x201C;&#x5206;&#x7247;&#x201D;&#x952E;&#x6216;&#x8303;&#x56F4;&#x7684;&#x786C;&#x76D8;&#x9A71;&#x52A8;&#x5668;&#x4E0A;&#x3002;&#x8FD9;&#x662F;&#x5206;&#x5272;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x4F60;&#x8FD0;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x7269;&#x7406;&#x673A;&#x5668;&#x65F6;&#x3002;</p>
<h2 id="&#x8BEF;&#x89E3;">&#x8BEF;&#x89E3;</h2>
<p>&#x5177;&#x6709;&#x8BBD;&#x523A;&#x610F;&#x5473;&#x7684;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E91;&#x5B58;&#x50A8;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x4EBA;&#x4EEC;&#x4ECD;&#x7136;&#x5728;&#x8FD9;&#x4E9B;&#x63D0;&#x4F9B;&#x5546;&#x7684;&#x6709;&#x9650;&#x9A71;&#x52A8;&#x5668;&#x4E0A;&#x90E8;&#x7F72;&#x548C;&#x5206;&#x5272;&#x6570;&#x636E;&#x5E93;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x5206;&#x7247;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x505A;&#x6CD5;&#xFF0C;&#x4F46;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x4E0D;&#x5229;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#xFF1A;</p>
<ul>
<li>A.&#x60A8;&#x652F;&#x4ED8;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x603B;&#x5206;&#x914D;&#x7684;&#x5B58;&#x50A8;&#x6210;&#x672C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x3002;</li>
<li>B.&#x60A8;&#x4ECD;&#x7136;&#x9700;&#x8981;devops&#x548C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x6765;&#x914D;&#x7F6E;&#x548C;&#x534F;&#x8C03;&#x5206;&#x7247;&#x952E;&#x548C;&#x6846;&#x3002;</li>
<li>C.&#x5177;&#x6709;&#x4E0D;&#x88AB;&#x9501;&#x5B9A;&#x5230;&#x4EFB;&#x4F55;&#x4E13;&#x6709;&#x865A;&#x62DF;&#x5316;&#x7CFB;&#x7EDF;&#x7684;&#x4F18;&#x52BF;&#x3002;</li>
</ul>
<p>&#x9009;&#x9879; (C) &#x672C;&#x8EAB;&#x662F;&#x503C;&#x5F97;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x662F;&#x7A81;&#x7136;&#x5F00;&#x59CB;&#x5728;&#x4E91;&#x4E2D;&#x5206;&#x7247;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x8FD9;&#x5B8C;&#x5168;&#x662F;&#x56E0;&#x4E3A;&#x4E91;&#x8BA1;&#x7B97;&#x7684;&#x5E95;&#x5C42;&#x914D;&#x7F6E;&#x662F;&#x4E13;&#x6709;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B8C;&#x5168;&#x4ECE;&#x4E91;&#x7AEF;&#x8FC1;&#x79FB;&#x5230; (3)&#x3002;
&#x6240;&#x4EE5;&#x5462;&#xFF1F;&#x4E5F;&#x8BB8;&#x4F60;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x4E91;&#x6765;&#x4F18;&#x5316;&#x6210;&#x672C;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B; (A) &#x53CD;&#x6B63;&#x4F1A;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x5982;&#x4F55;&#x63A5;&#x8FD1;&#x5B83;&#xFF0C;&#x8BD5;&#x56FE;&#x5728;&#x4E91;&#x4E2D;&#x788E;&#x7247;&#x662F;&#x4E00;&#x79CD;&#x8BEF;&#x89E3;&#xFF0C;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<p>&#x56E0;&#x6B64;&#xFF0C;GUN&#x4E0D;&#x5EFA;&#x8BAE;&#x5206;&#x7247;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5047;&#x5B9A;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x5C06;&#x5728;&#x4E91;&#x4E2D;&#x8FDB;&#x884C;&#x90E8;&#x7F72;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6D88;&#x9664;&#x4E86;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x75DB;&#x70B9; - &#x8BA9;GUN&#x6839;&#x636E;&#x52A8;&#x6001;&#x8D1F;&#x8F7D;&#x800C;&#x4E0D;&#x662F;&#x5B58;&#x50A8;&#x9650;&#x5236;&#x81EA;&#x52A8;&#x7F13;&#x5B58;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x7684;&#x5DE5;&#x4F5C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5FEB;&#x901F;&#xFF0C;&#x800C;&#x4E14;&#x60A8;&#x7684;&#x4E2A;&#x4EBA;&#x5DE5;&#x4F5C;&#x91CF;&#x4E5F;&#x66F4;&#x5C11;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x4F7F;&#x7528;GUN (3)&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F18;&#x5148;&#x6743;&#x548C;&#x65E0;&#x671F;&#x9650;&#x9009;&#x9879; (&#x6587;&#x4EF6;&#x6765;) &#x8FDB;&#x884C;&#x5206;&#x5272;&#x3002;&#x56E0;&#x6B64;&#xFF0C;GUN&#x5728;&#x7269;&#x7406;&#x4E0A;&#x5FC5;&#x8981;&#x65F6;&#x53EF;&#x4EE5;&#x788E;&#x7247;&#x5316;&#xFF0C;&#x4F46;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x5728;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x907F;&#x514D;GUN&#xFF0C;&#x4EE5;&#x964D;&#x4F4E;&#x6210;&#x672C;&#x548C;&#x590D;&#x6742;&#x6027;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ham.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 假设失忆症机器">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"切片","level":"1.8","depth":1,"previous":{"title":"假设失忆症机器","level":"1.7.1","depth":2,"path":"src/ham.md","ref":"src/ham.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"src/sharding.md","mtime":"2018-05-22T08:51:09.119Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-22T09:10:02.528Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

